{
    "name": "Simeon",
    "headerTaglineOne": "Hello 👋",
    "headerTaglineTwo": "I'm Simeon Petrovic - curious",
    "headerTaglineThree": "Generative AI, Blockchain, Gis, Mobile Developer",
    "headerTaglineFour": " based in Serbia.",
    "showCursor": true,
    "showBlog": false,
    "darkMode": true,
    "showResume": true,
    "socials": [
        {
            "id": "1",
            "title": "Github",
            "link": "https://github.com/newangry"
        },
        {
            "id": "2",
            "title": "LinkedIn",
            "link": "https://www.linkedin.com/in/simeon-petrovic-7a2193285/"
        },
        {
            "id": "5",
            "title": "Email",
            "link": "mailto:posture0096@gmail.com"
        }
    ],
    "projects": [
        {
            "id": "1",
            "title": "markprompt",
            "description": "This project is to generate chatbots that can answer based on trained data(uploaded data on platfrom) such pdf, doc, txt and websites content. The generated chatbots on platform is integrated with various platform using frameworks such as React, Vanila, Angular and PHP frameworks. If I can talk about role of this project, As I'm an Ai deveoper, I managed Vector DB, LLM, NLP and System Prompt. I used the supabase for semantic search and storing Vector db.",
            "imageSrc": "/markprompt.png",
            "url": "http://markprompt.com/"
        },
        {
            "id": "2",
            "title": "app.replient.ai",
            "description": "This project is intended to generate three suggestions to automatically or manually reply to users who left comments on Facebook based on the comments history, files, and company's websites of social websites such as Facebook, Instagra, linkedin, and Titick. I consider this project to be a project that evaluates the overall value of my AI experience so far by developing the entire project independently, including Front-End, Backend, AI Logic,and Social API.",
            "imageSrc": "/replient.png",
            "url": "http://app.replient.ai/"
        },
        {
            "id": "3",
            "title": "Wafi bot",
            "description": "On this platform, we can talk and chat with bot called wafi. There, I used the Pinecone as Vector DB and Langchain to manage the OpenAI. I implemented TTS and STT in talking with chatbot. What is also attractive about this project is that the bot changes into various animated emoticons depending on the content of the bot's answers, giving the feeling of talking to a real person. In the future, I plan to develop this further and actively respond based on the content of the answer as an actual moving person rather than an emoticon shaped like a bot.",
            "imageSrc": "/wafi.png",
            "url": "https://wafi-six.vercel.app/"
        },
        {
            "id": "4",
            "title": "TheAsiansocial",
            "description": "This projects is to introduce the cultural, events, productions of Asia. The Frontend and Backend are built by Next Js and used the Supabase as the database.",
            "imageSrc": "/asiansocial.png",
            "url": "http://theasiansocial.com/"
        }
    ],
    "services": [
        {
            "id": "1",
            "title": "Art Direction",
            "description": "We help with the creation and development of online advertising ideas, with particular focus on their visual appearance."
        },
        {
            "id": "2",
            "title": "Branding",
            "description": "We design key brand elements such as the logo, color scheme, typography, and other design components that makes your brand stand out from competitors."
        },
        {
            "id": "3",
            "title": "Web Design",
            "description": "We build and optimize your online presence.  Website is the digital entry point into your business and a powerful revenue channel."
        },
        {
            "id": "4",
            "title": "3D Design",
            "description": "We combine creative design and technical skills to build striking 3D visualisations that bring your project to life."
        }
    ],
    "aboutpara": "With over 7 years of experience as a senior software engineer, I have successfully developed and delivered a wide range of projects across various industries. My expertise encompasses frontend development with React.js, backend development with Node.js, Typescript, and backend scripting with Python and Java. I possess a strong understanding of modern development practices, including REST APIs, microservices, Machine Learning and cloud technologies. Throughout my career, I have demonstrated exceptional leadership skills and the ability to collaborate effectively with teams. I am also adept at adapting to different roles and consistently delivering high-quality solutions. As a proactive and results-oriented professional, I thrive in challenging and dynamic environments. My passion for continuous learning and staying up-to-date with the latest technologies enables me to constantly enhance and deliver innovative solutions",
    "resume": {
        "tagline": "👋  I'm a full-stack developer.",
        "description": "I have delivered world-class user experiences to millions of people. Well-versed with React, Javascript, and most of the Web frameworks.",
        "experiences": [
            {
                "id": "1",
                "dates": "NOV 2022 - JUN  2023",
                "type": "Full Time",
                "position": "Full Stack, Generative AI, NLP, LLM Developer (Lead Role)",
                "bullets": "During my time at Doppel N Marketing, Leveraging my expertise in Generative AI, National Language Process, Large Language Model and Vector Database, I optimized the accuracy of suggestions and analyzed results which will upload some social media. I also built a responsive and user-friendly Frontend that enabled users to access and interact easily with some companies' brands and services. I consistently focused on solid and safe backend development optimizing design of RESTful API and database performance."
            },
            {
                "id": "2",
                "dates": "Apr 2022 - SEP  2022 | United States",
                "type": "Full Time",
                "position": "Software Engineer (Lead Role)",
                "bullets": "During my time at TheGridbiz, I served as a Fullstack Software Engineer and made significant contributions to the Eventsync and Asiansocial project. Leveraging my expertise in JavaScript, Java, SpringBoot, React.js, and AWS, I lead the development of frontend and backend and delivered successfully."
            },
            {
                "id": "3",
                "dates": "July 2021 -  Feb 2022",
                "type": "Full Time",
                "position": "Blackwater Billing Services- Senior Software  Engineer",
                "bullets": "During my tenure at Xcel Medical Solutions, I served as a Fullstack Engineer and made significant contributions to the Telerad project. Leveraging my expertise in JavaScript, Python, Django, React.js, and Kubernetes, I bridged the reporting gap between radiologists and doctors. I created a structure that enabled doctors to access patient results as DICOM files, write studies on the reports, and create studies for further analysis. These advancements significantly improved collaboration and workflow between the Radiologist, Radiographer, and by extension Patient record."
            }
            ,
            {
                "id": "4",
                "dates": "March 2017 - April  2019",
                "type": "Full Time",
                "position": "Checkin Inc. New York - Senior Software Engineer ",
                "bullets": "The vacation rental industry is marked by a high volume of transactions and interactions between property owners and travelers. This often leads to disputes, booking cancellations, payment issues, and various other challenges that need to be addressed efficiently and effectively. The lack of a centralized and streamlined resolution center can result in poor customer satisfaction and increased operational inefficiencies."
            }
        ],
        "education": {
            "universityName": "The University of Belgrade",
            "universityDate": "Sep 2012 - Jun 2016",
            "universityPara": ""
        },
        "languages": [
            "Javascript",
            "HTML5",
            "CSS",
            "Python",
            "Go"
        ],
        "frameworks": [
            "React",
            "Typescript",
            "NodeJs",
            "Laravel",
            ".Net",
            "Next JS",
            "Dejango",
            "FastApi",
            "Vue",
            "Angular"
        ],
        "others": [
            "Generative AI",
            "Gis",
            "Blockchain",
            "AWS"
        ]
    }
}